/******************************************************************************************/	
/******************************************************************************************/
/**********************************sender**************************************************/
/******************************************************************************************/
/******************************************************************************************/

	void 等待发送端收到GoodCRC()
	{
		while( !PHYgetMsg )
		{}
		if( MsgID_New != MsgID )
			module_读取指令( Message = sfr_message );
		else
			sfr_message = 0; //对sfr_message寄存器复位，不一定是清0
			MsgID = MsgID + 1;
			module_retry(); //不能确定retry均是执行这个retry指令
	}


/******************************************************************************************/
/**********************定时器中断：nReceive时间内未收到GoodCRC*****************************/
/**********************优先级低，可被其它高优先级打断，但不一定回到原来位置****************/
/******************************************************************************************/	
	void interrupt_CRCReceive()
	{
		if( RetryCounter <= nRetryCount ) //nRetryCount=2
			MsgID = MsgID;
			module_retry(); //不能确定retry均是执行这个retry指令
		else
			module_Soft_Reset()；
	}
	
	
	void retry()
	{
		//具体retry指令是重新发送一遍，还是发送不同的指令？
	}
	
	void 读取指令()
	{
		if( 这个指令是GoodCRC )
			module_复位CRCReceive定时器；
			//通知上层已经完成一次发送操作
		else(这个指令是……)
			//做相应的操作
	}
	
	
/******************************************************************************************/	
/******************************************************************************************/
/*******************************receiver***************************************************/
/******************************************************************************************/
/******************************************************************************************/

	void 等待接收端收到Message()
	{
		while( !PHYgetMsg )
		{}
		if( MsgID_New != MsgID )
			module_sendGoodCRC();
			module_读取指令( Message = sfr_message );
		else
			sfr_message = GoodCRC; //即使MsgID相同，仍然返回GoodCRC
	}
